In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame({
                    'name':['vivek','ankit','bhavesh','golu'],
                    'age':[18,19,21,17],
                    'roll no':[45,12,8,23],
                    'student id':[748,934,174,927]
})

In [4]:
df

      name  age  roll no  student id
0    vivek   18       45         748
1    ankit   19       12         934
2  bhavesh   21        8         174
3     golu   17       23         927

In [5]:
for i in df.iterrows(): #based on row index
    print(i)

(0, name          vivek
age              18
roll no          45
student id      748
Name: 0, dtype: object)
(1, name          ankit
age              19
roll no          12
student id      934
Name: 1, dtype: object)
(2, name          bhavesh
age                21
roll no             8
student id        174
Name: 2, dtype: object)
(3, name          golu
age             17
roll no         23
student id     927
Name: 3, dtype: object)

In [6]:
for i,j in df.iterrows(): # here i indicate row index and j indicate data
    print(i,j)

0 name          vivek
age              18
roll no          45
student id      748
Name: 0, dtype: object
1 name          ankit
age              19
roll no          12
student id      934
Name: 1, dtype: object
2 name          bhavesh
age                21
roll no             8
student id        174
Name: 2, dtype: object
3 name          golu
age             17
roll no         23
student id     927
Name: 3, dtype: object

In [7]:
for i,j in df.iterrows(): # row index
    print(i)

0
1
2
3

In [8]:
for i,j in df.iterrows(): # row data
    print(j)

name          vivek
age              18
roll no          45
student id      748
Name: 0, dtype: object
name          ankit
age              19
roll no          12
student id      934
Name: 1, dtype: object
name          bhavesh
age                21
roll no             8
student id        174
Name: 2, dtype: object
name          golu
age             17
roll no         23
student id     927
Name: 3, dtype: object

In [9]:
df

      name  age  roll no  student id
0    vivek   18       45         748
1    ankit   19       12         934
2  bhavesh   21        8         174
3     golu   17       23         927

In [10]:
for i in df.iteritems(): # based on columns index
    print(i)

('name', 0      vivek
1      ankit
2    bhavesh
3       golu
Name: name, dtype: object)
('age', 0    18
1    19
2    21
3    17
Name: age, dtype: int64)
('roll no', 0    45
1    12
2     8
3    23
Name: roll no, dtype: int64)
('student id', 0    748
1    934
2    174
3    927
Name: student id, dtype: int64)

C:\Users\suraj\AppData\Local\Temp\ipykernel_30000\1162402754.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for i in df.iteritems(): # based on columns index

In [11]:
for i,j in df.iteritems(): # i is columns index and j is data with row index
    print(i,j)

name 0      vivek
1      ankit
2    bhavesh
3       golu
Name: name, dtype: object
age 0    18
1    19
2    21
3    17
Name: age, dtype: int64
roll no 0    45
1    12
2     8
3    23
Name: roll no, dtype: int64
student id 0    748
1    934
2    174
3    927
Name: student id, dtype: int64

C:\Users\suraj\AppData\Local\Temp\ipykernel_30000\4168623874.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for i,j in df.iteritems(): # i is columns index and j is data with row index

In [12]:
for i,j in df.iteritems(): # columns index
    print(i)

name
age
roll no
student id

C:\Users\suraj\AppData\Local\Temp\ipykernel_30000\3091638960.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for i,j in df.iteritems(): # columns index

In [13]:
for i,j in df.iteritems(): # data with row index
    print(j)

0      vivek
1      ankit
2    bhavesh
3       golu
Name: name, dtype: object
0    18
1    19
2    21
3    17
Name: age, dtype: int64
0    45
1    12
2     8
3    23
Name: roll no, dtype: int64
0    748
1    934
2    174
3    927
Name: student id, dtype: int64

C:\Users\suraj\AppData\Local\Temp\ipykernel_30000\585557123.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for i,j in df.iteritems(): # data with row index

In [14]:
df

      name  age  roll no  student id
0    vivek   18       45         748
1    ankit   19       12         934
2  bhavesh   21        8         174
3     golu   17       23         927

In [15]:
df['new age'] = df['age'].apply(lambda x:x+2) # it change whole data according to function

In [16]:
df

      name  age  roll no  student id  new age
0    vivek   18       45         748       20
1    ankit   19       12         934       21
2  bhavesh   21        8         174       23
3     golu   17       23         927       19

In [17]:
df['name length'] = df['name'].apply(lambda x:len(x))

In [18]:
df

      name  age  roll no  student id  new age  name length
0    vivek   18       45         748       20            5
1    ankit   19       12         934       21            5
2  bhavesh   21        8         174       23            7
3     golu   17       23         927       19            4

In [19]:
df['age status'] = df['age'].apply(lambda x:"teen" if x<=18 else "adult")

In [20]:
df

      name  age  roll no  student id  new age  name length age status
0    vivek   18       45         748       20            5       teen
1    ankit   19       12         934       21            5      adult
2  bhavesh   21        8         174       23            7      adult
3     golu   17       23         927       19            4       teen

In [21]:
df1 = df[['age','roll no','student id']]

In [22]:
df1

   age  roll no  student id
0   18       45         748
1   19       12         934
2   21        8         174
3   17       23         927

In [23]:
df1.applymap(lambda x:x/2) # apply condition on whole data

    age  roll no  student id
0   9.0     22.5       374.0
1   9.5      6.0       467.0
2  10.5      4.0        87.0
3   8.5     11.5       463.5

In [24]:
df1.apply(lambda x:x/2) # based on axis

    age  roll no  student id
0   9.0     22.5       374.0
1   9.5      6.0       467.0
2  10.5      4.0        87.0
3   8.5     11.5       463.5

In [25]:
df

      name  age  roll no  student id  new age  name length age status
0    vivek   18       45         748       20            5       teen
1    ankit   19       12         934       21            5      adult
2  bhavesh   21        8         174       23            7      adult
3     golu   17       23         927       19            4       teen

In [26]:
df.sort_values('name') # sort by columns

      name  age  roll no  student id  new age  name length age status
1    ankit   19       12         934       21            5      adult
2  bhavesh   21        8         174       23            7      adult
3     golu   17       23         927       19            4       teen
0    vivek   18       45         748       20            5       teen

In [27]:
df.sort_index(ascending=False) # sort by index

      name  age  roll no  student id  new age  name length age status
3     golu   17       23         927       19            4       teen
2  bhavesh   21        8         174       23            7      adult
1    ankit   19       12         934       21            5      adult
0    vivek   18       45         748       20            5       teen

In [28]:
pd.set_option('display.max_colwidth',20)
df2 = pd.DataFrame({
    'desc':['my name is vivek and I am studying in MCC collage ']
})

In [29]:
df2

                  desc
0  my name is vivek...

In [30]:
df2['desc length'] = df2['desc'].apply(len)

In [31]:
df2

                  desc  desc length
0  my name is vivek...           50

In [32]:
l = 'I am going to village for vacation'
l.split()

['I', 'am', 'going', 'to', 'village', 'for', 'vacation']

In [33]:
len(l.split())

7

In [34]:
df2['word count'] = df2['desc'].apply(lambda x:len(x.split()))

In [35]:
df2

                  desc  desc length  word count
0  my name is vivek...           50          11

In [36]:
df

      name  age  roll no  student id  new age  name length age status
0    vivek   18       45         748       20            5       teen
1    ankit   19       12         934       21            5      adult
2  bhavesh   21        8         174       23            7      adult
3     golu   17       23         927       19            4       teen

In [40]:
df['age'].mean()

18.75

In [41]:
df['age'].median()

18.5

In [42]:
df['age'].mode()

0    17
1    18
2    19
3    21
Name: age, dtype: int64

In [43]:
df['age'].var()

2.9166666666666665

In [44]:
df['age'].std()

1.707825127659933

In [45]:
df['age'].sum()

75

In [46]:
df['age'].min()

17

In [47]:
df['age'].max()

21

In [48]:
df3 = pd.DataFrame({
                'num':[1,3,2,5,4,6,4]
})

In [49]:
df3

   num
0    1
1    3
2    2
3    5
4    4
5    6
6    4

In [52]:
df3['num'].rolling(window=1).mean()

0    1.0
1    3.0
2    2.0
3    5.0
4    4.0
5    6.0
6    4.0
Name: num, dtype: float64

In [56]:
df3['num'].rolling(window=2).mean()

0    NaN
1    2.0
2    2.5
3    3.5
4    4.5
5    5.0
6    5.0
Name: num, dtype: float64

In [57]:
df3['num'].rolling(window=3).mean()

0         NaN
1         NaN
2    2.000000
3    3.333333
4    3.666667
5    5.000000
6    4.666667
Name: num, dtype: float64